In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('spam.csv', encoding='latin-1')

In [3]:
df.head(10)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,ham,"Go until jurong point, crazy.. Available only ...",NaN,NaN,NaN
1,ham,Ok lar... Joking wif u oni...,NaN,NaN,NaN
2,spam,Free entry in 2 a wkly comp to win FA Cup fina...,NaN,NaN,NaN
3,ham,U dun say so early hor... U c already then say...,NaN,NaN,NaN
4,ham,"Nah I don't think he goes to usf, he lives aro...",NaN,NaN,NaN
5,spam,FreeMsg Hey there darling it's been 3 week's n...,NaN,NaN,NaN
6,ham,Even my brother is not like to speak with me. ...,NaN,NaN,NaN
7,ham,As per your request 'Melle Melle (Oru Minnamin...,NaN,NaN,NaN
8,spam,WINNER!! As a valued network customer you have...,NaN,NaN,NaN
9,spam,Had your mobile 11 months or more? U R entitle...,NaN,NaN,NaN

In [4]:
df.shape

(5572, 5)

In [5]:
# 1. Data CLeaning
# 2. EDA-- Exploratory Data Analysis
# 3. Text Preprocessing
# 4. Model Building
# 5. Evaluation of Model
# 6. Improvement of Model 
# 7. Website Building and Other
# 8. Deploy in server

 ## Step 1. Data Cleaning of spam Data

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [7]:
# Dropping last 3 columns as we have only 50 rows at max from which we cannot analyze anything beacuse it is o less data
df.drop(columns=['Unnamed: 4','Unnamed: 3','Unnamed: 2'],inplace=True)

In [8]:
df.sample(5)

        v1                                                 v2
929   spam  money!!! you r a lucky winner ! 2 claim your p...
3784   ham  Let me know if you need anything else. Salad o...
3510   ham             I'm serious. You are in the money base
287    ham  hi baby im cruisin with my girl friend what r ...
5393   ham  All done, all handed in. Don't know if mega sh...

In [9]:
df.shape

(5572, 2)

In [10]:
# Renaimg a columns
df.rename(columns={'v1':'target','v2':'text'},inplace=True)
df.sample(3)

     target                                               text
126     ham  Just so that you know,yetunde hasn't sent mone...
5394    ham          I dont know exactly could you ask chechi.
241     ham      PLEASSSSSSSEEEEEE TEL ME V AVENT DONE SPORTSx

In [11]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [12]:
# Changes ham to 0 and spam to 1
df['target'] = encoder.fit_transform(df['target'])

In [13]:
df.head(2)

   target                                               text
0       0  Go until jurong point, crazy.. Available only ...
1       0                      Ok lar... Joking wif u oni...

In [14]:
# Checking Missing Values
df.isnull().sum()

target    0
text      0
dtype: int64

In [15]:
# Checking for Duplicate Values
df.duplicated().sum()

403

In [16]:
# Removing Duplicate
df = df.drop_duplicates(keep='first')

In [17]:
df.shape

(5169, 2)

In [21]:
print(f"Duplicate Value is: {df.duplicated().sum()}")
print(f"Number of Null Value Value is: {df.isnull().sum()}")

Duplicate Value is: 0
Number of Null Value Value is: target    0
text      0
dtype: int64